

class PatternMessage {
  static String getMessage(String pattern) {
    switch (pattern) {
      case 'المنجز':
        return '''<h2><b>يجب أن أبقى مشغولاً</b></h2>
<p>يقع هذا النمط ضمن مركز المشاعر وهم الأكثر ابتعاداً عن مشاعرهم وعن موضوع العواطف حيث اكتسبوا في مراحل نمو شخصيتهم أن يضعوا مشاعرهم وعواطفهم جانباً ساعين من وراء ذلك إلى تحقيق قدر من الفاعلية في البيئة المحيطة</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-طموح
 <br>-برجماتي
 <br>-تكيفى
 <br>-واثق من نفسه
 <br>-نرجسي 
 <br>-عدائي
 <br>-مخلص لعمله
 <br>-لديه قدرة عجيبة في تنشيط الآخرين
 <br>-موجه نحو الإنجاز
 
  <li><b>جوانب القوة:-</b> </li>
  <br>العمل بجد لتحقيق النجاح 
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من أن يكون عديم القيمة
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>الشعور بالقيمة والجدارة والاهتمام والتقدير
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-يريد أن يكون ذا شخصية توكيدية
  <br>-يريد أن يتميز عن الآخرين ويؤثر عليهم
  <br>-يريد أن يجذب الانتباه ويثير الإعجاب
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>إدمان العمل والمنافسة
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>التعزيز والتحفيز
</ul>''';

      case 'المتحدي':
        return '''<h2><b>أحتاج لأن أكون قوياً</b></h2>
<p>يقع هذا النمط ضمن مركز الغريزة ، يتصف أفراد هذا النمط بأنهم لديهم إفراط في العلاقات مع البيئة المحيطة بهم، كونهم يجدون أنفسهم أعظم وأكبر من الآخرين، ولذلك فهم يسعون نحو السيطرة والتحكم في العالم المحيط بهم ساعين لجعله متطابقاً ومتسقاً مع تصوراتهم الشخصية</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-حاسم
 <br>-مسيطر
 <br>-مولع بالقتال
 <br>-واثق من نفسه
 <br>-مدمر 
 <br>-مستبد
 <br>-سلطوى واسع الحيلة
 <br>-صريح
 <br>-يستخدم قوته لقيادة الآخرين
 <br>يستخدم قدرته فى دعم ومساندة وتحقيق الرفاهية للآخرين
 
  <li><b>جوانب القوة:-</b> </li>
  <br>الصراحة والحزم وحماية الآخرين وفرض العدالة 
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من أن يصاب بأذى أو الخضوع لهيمنة الآخرين
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>الاعتماد على النفس
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-يريد أن يثبت قوته ويقاوم جوانب الضعف
  <br>-ن يكون مهيمناً في عالمه ويسيطر على البيئة
  <br>-أن يظل مسيطراً على الموقف
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>مزاجه والسماح لنفسه للتعرض للأخطار التهور والسيطرة
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>الأوامر
</ul>''';

      case 'المتحمس':
        return '''<h2><b>أحتاج للبحث عن المغامرةً</b></h2>
<p>يقع هذا النمط ضمن مركز التفكير ويتصف أفراده بأنهم مفرطون في الأفعال ومفرطون في إستخدام قدراتهم وطاقاتهم، والسعي الحثيث للانشغال الدائم تجنباً لمواجهة الشعور بالقلق، وكذلك يبدو عليهم الاستسلام لاندفاعاتهم إلى الحد الذى يصبحون فيه مفرطى النشاط هروبيين - هوسيين - ونهاية الأمر خارج حدود السيطرة</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-عفوى
 <br>-ملئ بالحماس 
 <br>-مهذب 
 <br>-متهور 
 <br>-مستهتر 
 <br>-مهووس 
 <br>-محب للحياة متفائل
 <br>-يستمتع بكل ما هو جديد
 <br>-يميل للمغامرة
 <br>-يسعى إلى جعل العالم مكاناً أفضل
 <br>-يمل من الروتين
 <br>-طليق الحركة
 
  
  <li><b>جوانب القوة:-</b> </li>
  <br>سعاد الذات والآخرين 
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من أن يعاني من الحرمان والألم
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>أن يكون لديه قناعة ورضا وأن تتحقق حاجاته
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-رغب في تحقيق سعادته وحريته
  <br>-يتجنب الشعور بالحرمان من خلال أن يظل في حالة إثارة وانشغال 
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>نفاذ الصبر والتمرد وشرود الذهن
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>الحكايات القصصية
</ul>''';

      case 'المساعد':
        return '''<h2><b>أحتاج للبحث عن المغامرةً</b></h2>
<p>يجب أن أساعد الآخرين
يقع هذا النمط ضمن مركز المشاعر، وهو مفرط في التعبير عن مشاعره ويبالغون كثيراً في إظهار مشاعرهم الإيجابية نحو الآخرين في حين يكبتون مشاعرهم السلبية مثل الغضب والامتعاض واستيائهم الشديد عند عدم حصولهم على التقدير الكافي</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-عطوف
 <br>-ودود 
 <br>-كريم 
 <br>-مخلص 
 <br>-حنون 
 <br>-يقدم الرعاية والاهتمام 
 <br>-حسن النية
 <br>-مجامل
 <br>-يحسن التملق لجذب انتباه الآخرين
 <br>-يضحى بنفسه ويستمتع بالعطاء ورعاية الآخرين

 
  
  <li><b>جوانب القوة:-</b> </li>
  <br>تغير الذات لتلبية حاجات الآخرين 
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من أن يصبح غير مطلوب أو غير مرغوب فيه
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>أن يخطو بالحب بدون قيد أو شرط
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-يريد أن يكون محبوب من الآخرين ويعبر عن مشاعره تجاه الآخرين
  <br>-يريد أن يكون مرغوب وموضع تقدير وأن يتجاوب معه الغير 
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>حب التملك وشكر الناس له
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>تقديم المساعدة والنصيحة
</ul>''';

      case 'المتفرد':
        return '''<h2><b>يجب أن أكون مختلفاًً</b></h2>
<p>يقع هذا النمط ضمن مركز المشاعر ويعانون من ضعف في التعبير عن مشاعرهم وذلك بسبب الشعور بالخجل من أنفسهم ومن مواجهة حاجاتهم ورغباتهم واندفاعاتهم ، لذلك يسلكون بصورة بديلة تعبر عن حقيقة تلك الرغبات الدفينة نحو أشكال من الفنون أو الأعمال الجمالية، أو غيرها مما تحمل طابع الأدب أو الفن</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-متفرد
 <br>-مبدع 
 <br>-منعزل انطوائي
 <br>-كئيب
 <br>-متقلب المزاج
 <br>-صادم في انفعالاته 
 <br>-بعد نفسه عن الآخرين بسبب شعوره بأنه معرض للخطر وأنه يعانى من العيوب
 <br>-لديه القدرة على مساعدة الآخرين في المواقف المؤلمة انفعاليًا
 
  
  <li><b>جوانب القوة:-</b> </li>
  <br>تحويل الصورة الجميلة إلى واقع 
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من أن يكون بلا هوية أو دلالة شخصية
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>أن يجد نفسه ويحقق ذاته (خلق الهوية)
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-التعبير عن نفسه وشخصيته الفريدة
  <br>-الاحتفاظ بأمزجة ومشاعر معينة 
  <br>-الاهتمام بالحاجات الانفعالية قبل الاهتمام بأى شئ آخر
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>الحزن والكأبة والانغماس في الذات والشفقة على الذات
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>المقارنات
</ul>''';

      case 'المخلص':
        return '''<h2><b>يجب أن أشعر بالأمان</b></h2>
<p>يقع هذا ضمن مركز التفكير وأصحابه يبتعدون عن الفعل أو يجد صعوبة في قدرتهم على الفعل بصورة مستقلة عن الآخرين، إذ إن الاعتمادية تكون الصفة الغالبة في سلوكهم الأمر الذي يوفر لهم الشعور بالأمان في ظل توجيهات الآخرين لهم</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-ملتزم
 <br>-محافظ
 <br>-تقليدي
 <br>-محبوب 
 <br>-مدافع 
 <br>-مجد فى العمل 
 <br>-مسئوول
 <br>-مخلص للعائلة والأصدقاء
 <br>-موجه نحو الأمن
 <br>-متعاون
 <br>-موضع ثقة ويمكن الاعتماد عليه
 <br>-سعى إلى أن يحظى بالقبول من الشخصيات التي تمثل السلطة
 
  
  <li><b>جوانب القوة:-</b> </li>
  <br>الولاء، وتحمل المسئوولية 
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من عدم القدرة على الحياة معتمد على نفسه
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>أن ينعم بالأمن والدعم
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-يريد أن ينعم بالأمن ويشعر بمساندة الآخرين له الشعور بالطمأنينة نحو الآخرين
  <br>-تجنب المخاطر وعدم الاقتراب منها
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>القلق والاحتراس الزائد
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>التفكير الجماعي
</ul>''';

      case 'صانع السلام':
        return '''<h2><b>يجب أن أكون مقبولاً</b></h2>
<p>يقع هذا النمط ضمن مركز الغريزة، وأصحاب هذا النمط يبدو أنهم بعيدون عن الاتصال والتفاعل مع البيئة المحيطة، بالرغم من كونهم قد يقيمون اتصالاً وتفاعلاً مع البيئة بتبنى أفكار الآخرين وتصوراتهم، وكذلك بالاندماج والاتفاق مع الآخرين وعدم الشذوذ عنهم محاولين في ذلك تجنب المواجهة معهم بكل الطرق الممكنة وإن تطلب ذلك الأمر منهم أن يتخلوا عن هويتهم الشخصية</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-مسالم
 <br>-يتصف بالقبول
 <br>-مطمئن
 <br>-هادئ 
 <br>-متمهل 
 <br>-يسعى نحو الألفة مع الناس 
 <br>-الاندماج مع العالم المحيط به
 <br>-يكره الصراعات
 <br>-مبسط للمشاكل
 
 
  
  <li><b>جوانب القوة:-</b> </li>
  <br>معرفة ما يعانى منه الآخرين ومشاركة الآخرين تخطيطهم لأعمالهم كما لو كانت أعماله الخاصة
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من الخسارة والانعزال
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>الاستقرار الداخلي وراحة البال
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-حداث التناغم مع البيئة
  <br>-تجنب الصراعات والتوتر
  <br>-إدراك الأمور كما هي ومقاومة القلق والإزعاج
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>القصور الذاتي والعناد
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>قصص الأبطال(الملاحم)
</ul>''';

      case 'المصلح':
        return '''<h2><b>يجب أن أكون كاملاً</b></h2>
<p>يقع هذا النمط ضمن مركز الغريزة ، فهو يتصف بضعف الاتصال مع البيئة وذلك لشعوره بأن البيئة تقع تحت مستوى المثالية التى يعتقد ويؤمن بها، كما يشعر بأنه يتوجب عليه السيطرة والتحكم بنفسه وفق ما يمليه عليه ضميره الذى عادة ما يشكل مصدر الضبط له وللآخرين</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-عقلاني
 <br>-صاحب مبدأ
 <br>-منظم
 <br>-محب الكمال 
 <br>-راض عن نفسه
 <br>-لديه معايير أخلاقية عالية 
 <br>-يراعى ضميره
 <br>-لديه قدرة على التمييز بين الصواب والخطأ
  
  <li><b>جوانب القوة:-</b> </li>
  <br>العمل بجد لتحسين الذات والآخرين والمواقف
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من أن يكون ذا عيوب والخوف من الوقوع في الأخطاء
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>أن يكون صالحاً ومتسماً بالنزاهة والاتزان
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-يريد أن يكون على حق
  <br>-يسعى إلى الأعلى وتحسين كل شئ ليتفق مع مثله الأعلى
  <br>-يسعى أن يكون خارج دائرة النقد حتى لا يلومهم أي شخص
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>الرفض وفراغ الصبر
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>الوعظ والتعليم
</ul>''';

      case 'الباحث':
        return '''<h2><b>يجب أن أعرف أكثر</b></h2>
<p>يقع هذا النمط ضمن مركز التفكير ، أصحاب هذا النمط يستبدلون الفعل بالتفكير، ولذا فإن قدرتهم على الفعل تبقى ضعيفة ، كما إنهم قد يواجهون صعوبة في إيجاد نهاية للمعارف والعلوم والمعلومات وفيما يرغبون في فهمه (ففى كثير من الأحيان لا ينتفعون بما لديهم من معرفة ومعلومات متحققة)، ويتجهون إلى تبنى الأفكار المعقدة والمجردة</p>
<ul>
  <li><b>صفاتهم:-</b></li>
 <br>-مفكر
 <br>-محلل
 <br>-مدرك
 <br>-شكاك 
 <br>-متمركز حول ذاته
 <br>-غريب الأطوار 
 <br>-لديه حب استطلاع
 <br>-لديه فراسة بصيرة وبعد نظر
 <br>-لديه قدرة على التركيز في تطوير الأفكار المعقدة والمهارات
  
  <li><b>جوانب القوة:-</b> </li>
  <br>جمع وتنظيم وتفسير المعرفة والتزام الهدوء والتفكير
  <li><b>الخوف الأساسي لديهم:-</b> </li>
  <br>من أن يكون عديم الفائدة ولا حول له ولا قوة ولا قدرة
  <li><b>الرغبة الأساسية لديهم:-</b> </li>
  <br>أن يمتلك القدرة والكفاءة
  <li><b>دوافعهم الأساسية:-</b> </li>
  <br>-امتلاك المعرفة وفهم البيئة
  <br>-حساب كل شئ كطريقة للدفاع عن نفسه من تهديدات البيئة
  <li><b>لديهم مشاكل مع:-</b> </li>
  <br>العزلة والوحدة والدونية وغرابة الأطوار
  <li><b>أسلوب التواصل المفضل معهم:-</b> </li>
  <br>الرسائل العلمية
</ul>''';

      default:
        return '';
    }
  }

  static String getImage(String pattern) {
    switch (pattern) {
      case 'المنجز':
        return 'assets/images/mnjis.jpg';
      case 'المتحدي':
        return 'assets/images/mthdy.jpg';
      case 'المتحمس':
        return 'assets/images/mthms.jpg';
      case 'المساعد':
        return 'assets/images/msaed.jpg';
      case 'المتفرد':
        return 'assets/images/mtfred.jpg';
      case 'المخلص':
        return 'assets/images/mkles.jpg';
      case 'صانع السلام':
        return 'assets/images/pease.jpg';
      case 'المصلح':
        return 'assets/images/msaleh.jpg';
      case 'الباحث':
        return 'assets/images/albahth.jpg';
      default:
        return 'assets/images/imag1.jpg'; // صورة افتراضية
    }
  }
}
