class QuestionData {
  static final List<Map<String, String>> questionPatternMap = [
    // المنجز
    {'code': 'A1', 'question': 'أهتم بإنجاز الأعمال بشكلٍ أفضل من الآخرين', 'pattern': 'المنجز'},
    {'code': 'A2', 'question': 'أنظر إلى الأمور بواقعية', 'pattern': 'المنجز'},
    {'code': 'A3', 'question': 'أنا دقيق في آداء مهامي', 'pattern': 'المنجز'},
    {'code': 'A4', 'question': 'أعتمد على نفسي في آداء مهامي', 'pattern': 'المنجز'},
    {'code': 'A5', 'question': 'أقاتل لأصل إلى النجاح الذي أريده', 'pattern': 'المنجز'},

    // المتحدي
    {'code': 'C1', 'question': 'أحب خوض التحديات مع الآخرين', 'pattern': 'المتحدي'},
    {'code': 'C2', 'question': 'لدي القدرة على مواجهة المشاكل', 'pattern': 'المتحدي'},
    {'code': 'C3', 'question': 'أتصف بالإقدام والشجاعة', 'pattern': 'المتحدي'},
    {'code': 'C4', 'question': 'أميل لقيادة الآخرين', 'pattern': 'المتحدي'},
    {'code': 'C5', 'question': 'أميل نحو مجابهة الآخرين', 'pattern': 'المتحدي'},

    // المتحمس
    {'code': 'E1', 'question': 'أتصرف بكل تلقائية مع الآخرين دون التفكير في العواقب', 'pattern': 'المتحمس'},
    {'code': 'E2', 'question': 'أحاول جعل حياتي مليئة بالإثارة', 'pattern': 'المتحمس'},
    {'code': 'E3', 'question': 'أشعر بأن لدي طاقة وحيوية كبيرتين', 'pattern': 'المتحمس'},
    {'code': 'E4', 'question': 'أميل لأكون مغامراً ومجازفاً', 'pattern': 'المتحمس'},
    {'code': 'E5', 'question': 'أميل للعفوية والمرح', 'pattern': 'المتحمس'},

    // المساعد
    {'code': 'H1', 'question': 'أحرص على الاعتناء بالآخرين من حولي', 'pattern': 'المساعد'},
    {'code': 'H2', 'question': 'أبادر لتقديم المساعدة للآخرين', 'pattern': 'المساعد'},
    {'code': 'H3', 'question': 'أميل للتضحية من أجل الآخرين', 'pattern': 'المساعد'},
    {'code': 'H4', 'question': 'أشعر بالتعاطف مع الآخرين', 'pattern': 'المساعد'},
    {'code': 'H5', 'question': 'أولي اهتماماً كبيراً للعلاقات الاجتماعية والصداقات', 'pattern': 'المساعد'},

    // المتفرد
    {'code': 'I1', 'question': 'أنا شخص حساس عندما ينتقدني الآخرون', 'pattern': 'المتفرد'},
    {'code': 'I2', 'question': 'أميل لأكون مزاجياً', 'pattern': 'المتفرد'},
    {'code': 'I3', 'question': 'لدي احساس بضعف الثقة في النفس', 'pattern': 'المتفرد'},
    {'code': 'I4', 'question': 'أعاني من التغلب على مشاعري المؤلمة', 'pattern': 'المتفرد'},
    {'code': 'I5', 'question': 'أنا شخص رومانسي وخيالي', 'pattern': 'المتفرد'},

    // المخلص
    {'code': 'L1', 'question': 'أقف بجانب أصدقائي حتى عندما يكونون على خطأ', 'pattern': 'المخلص'},
    {'code': 'L2', 'question': 'أقع في المشاكل مع الآخرين لكوني مراوغاً وشكاكاً', 'pattern': 'المخلص'},
    {'code': 'L3', 'question': 'أجد صعوبة في اتخاذ القرارات', 'pattern': 'المخلص'},
    {'code': 'L4', 'question': 'أميل للتردد والمماطلة', 'pattern': 'المخلص'},
    {'code': 'L5', 'question': 'أعتمد على أصدقائي في اتخاذ قراراتي', 'pattern': 'المخلص'},

    // صانع السلام
    {'code': 'P1', 'question': 'استسلم بسهولة عند مواجهة المشاكل والمحن', 'pattern': 'صانع السلام'},
    {'code': 'P2', 'question': 'أخجل من إظهار قدراتي ومهاراتي أمام الآخرين', 'pattern': 'صانع السلام'},
    {'code': 'P3', 'question': 'أتجنب مواجهة الآخرين', 'pattern': 'صانع السلام'},
    {'code': 'P4', 'question': 'تعجبني أفكار الآخرين أكثر من أفكاري', 'pattern': 'صانع السلام'},
    {'code': 'P5', 'question': 'أفضل أن يأخذ غيري زمام القيادة في المواقف المختلفة', 'pattern': 'صانع السلام'},

    // المصلح
    {'code': 'R1', 'question': 'أنا متصلب في رأيي عند التعامل مع الآخرين', 'pattern': 'المصلح'},
    {'code': 'R2', 'question': 'يهمني نجاح العمل ولو أغضب ذلك الآخرين', 'pattern': 'المصلح'},
    {'code': 'R3', 'question': 'أشعر بأنني مثالي بدرجة عالية', 'pattern': 'المصلح'},
    {'code': 'R4', 'question': 'أسعى دوماً إلى الكمال', 'pattern': 'المصلح'},
    {'code': 'R5', 'question': 'أساعد الناس على اكتشاف أخطائهم', 'pattern': 'المصلح'},

    // الباحث
    {'code': 'V1', 'question': 'يعتمد الآخرون على ما لديّ من معرفة وخبرة', 'pattern': 'الباحث'},
    {'code': 'V2', 'question': 'أقترح حلولاً غير مألوفة للمشكلات.', 'pattern': 'الباحث'},
    {'code': 'V3', 'question': 'أحاول أن أبتكر أشياء جديدة', 'pattern': 'الباحث'},
    {'code': 'V4', 'question': 'أميل إلى تقديم البراهين بقوة عندما أتناقش مع أصدقائي', 'pattern': 'الباحث'},
    {'code': 'V5', 'question': 'أميل إلى تجربة الأشياء الجديدة', 'pattern': 'الباحث'},
  ];
}

